<?php

return [

    /*
    |--------------------------------------------------------------------------
    | சரிபார்ப்பு மொழி வரிகள்
    |--------------------------------------------------------------------------
    |
    | இங்கு உள்ள சரிபார்ப்பு மொழி வரிகளை, சரிபார்ப்பாளர் வகுப்பில் பயன்படுத்தப்படும்
    | பொது பிழைச் செய்திகள் உள்ளன. நீங்கள் அவற்றை விரும்பியபடி மாற்றலாம்.
    |
    */
    'nic_required' => 'தேசிய அடையாள அட்டை இலக்கம் தேவை',
    'nic_unique' => 'தேசிய அடையாள அட்டை எண் இருந்தது!',
    'accepted' => 'ஏற்றுக்கொள்ளப்பட்டுள்ளது',
    'accepted_if' => ':other :value ஆக இருந்தால், :attribute மைதானம் ஏற்கப்பட வேண்டும்.',
    'active_url' => ':attribute சரியான URL ஆக இருக்க வேண்டும்.',
    'after' => ':attribute :date க்குப் பிறகு ஒரு தேதி ஆக இருக்க வேண்டும்.',
    'after_or_equal' => ':attribute :date க்கு சமமாக அல்லது அதற்கு பிறகு இருக்க வேண்டும்.',
    'alpha' => ':attribute மைதானத்தில் எழுத்துக்கள் மட்டுமே இருக்க வேண்டும்.',
    'alpha_dash' => ':attribute மைதானத்தில் எழுத்துக்கள், எண்கள், கோடுகள் மற்றும் அடிக்கோடுகள் மட்டுமே இருக்க வேண்டும்.',
    'alpha_num' => ':attribute மைதானத்தில் எழுத்துக்கள் மற்றும் எண்கள் மட்டுமே இருக்க வேண்டும்.',
    'array' => ':attribute மைதானம் ஒரு வரிசையாக இருக்க வேண்டும்.',
    'ascii' => ':attribute மைதானம் ஒரே பைட்டால் உள்ளமிக்க எழுத்துகள் மற்றும் சின்னங்களை மட்டுமே கொண்டிருக்க வேண்டும்.',
    'before' => ':attribute :date க்கு முந்தைய தேதி ஆக இருக்க வேண்டும்.',
    'before_or_equal' => ':attribute :date க்கு சமமாக அல்லது அதற்கு முந்தைய தேதி ஆக இருக்க வேண்டும்.',
    'between' => [
        'array' => ':attribute மைதானத்தில் :min முதல் :max பொருட்கள் இருக்க வேண்டும்.',
        'file' => ':attribute :min மற்றும் :max கிலோபைட்டுகளுக்கு இடையில் இருக்க வேண்டும்.',
        'numeric' => ':attribute :min மற்றும் :max இடையில் இருக்க வேண்டும்.',
        'string' => ':attribute :min மற்றும் :max எழுத்துக்களுக்கு இடையில் இருக்க வேண்டும்.',
    ],
    'boolean' => ':attribute மைதானம் சரியானது அல்லது தவறானது ஆக இருக்க வேண்டும்.',
    'can' => ':attribute மைதானத்தில் அனுமதிக்கப்படாத மதிப்பு உள்ளது.',
    'confirmed' => ':attribute மைதான உறுதிப்படுத்தல் பொருந்தவில்லை.',
    'current_password' => 'கடவுச்சொல் தவறானது.',
    'date' => ':attribute சரியான தேதி ஆக இருக்க வேண்டும்.',
    'date_equals' => ':attribute :date க்கு சமமான தேதி ஆக இருக்க வேண்டும்.',
    'date_format' => ':attribute :format வடிவத்துடன் பொருந்த வேண்டும்.',
    'decimal' => ':attribute மைதானத்தில் :decimal தசம நிலை இருக்க வேண்டும்.',
    'declined' => ':attribute மைதானம் நிராகரிக்கப்பட வேண்டும்.',
    'declined_if' => ':other :value ஆக இருந்தால், :attribute மைதானம் நிராகரிக்கப்பட வேண்டும்.',
    'different' => ':attribute மற்றும் :other மைதானங்கள் மாறுபட வேண்டும்.',
    'digits' => ':attribute மைதானத்தில் :digits இலக்கங்கள் இருக்க வேண்டும்.',
    'digits_between' => ':attribute மைதானம் :min மற்றும் :max இலக்கங்களுக்கு இடையில் இருக்க வேண்டும்.',
    'dimensions' => ':attribute மைதானத்தில் தவறான பட அளவுகள் உள்ளன.',
    'distinct' => ':attribute மைதானத்தில் மீண்டும் சேர்க்கப்பட்ட மதிப்பு உள்ளது.',
    'doesnt_end_with' => ':attribute மைதானம் :values யில் ஒன்றால் முடிவடையக்கூடாது.',
    'doesnt_start_with' => ':attribute மைதானம் :values யில் ஒன்றால் தொடங்கக்கூடாது.',
    'email' => ':attribute மைதானம் சரியான மின்னஞ்சல் முகவரியாக இருக்க வேண்டும்.',
    'ends_with' => ':attribute மைதானம் :values இல் ஒன்றாக முடிவடைய வேண்டும்.',
    'enum' => 'தேர்ந்தெடுக்கப்பட்ட :attribute தவறானது.',
    'exists' => 'தேர்ந்தெடுக்கப்பட்ட :attribute தவறானது.',
    'extensions' => ':attribute மைதானத்தில் :values இல் ஒன்றாக இருக்க வேண்டும்.',
    'file' => ':attribute ஒரு கோப்பாக இருக்க வேண்டும்.',
    'filled' => ':attribute மைதானத்தில் ஒரு மதிப்பு இருக்க வேண்டும்.',
    'gt' => [
        'array' => ':attribute மைதானத்தில் :value பொருட்களுக்கு மேல் இருக்க வேண்டும்.',
        'file' => ':attribute :value கிலோபைட்டுகளுக்கும் மேல் இருக்க வேண்டும்.',
        'numeric' => ':attribute :value க்கு மேல் இருக்க வேண்டும்.',
        'string' => ':attribute :value எழுத்துக்களுக்கு மேல் இருக்க வேண்டும்.',
    ],
    'gte' => [
        'array' => ':attribute மைதானத்தில் :value பொருட்கள் அல்லது அதிகமாக இருக்க வேண்டும்.',
        'file' => ':attribute :value கிலோபைட்டுகளுக்கும் மேல் அல்லது சமமாக இருக்க வேண்டும்.',
        'numeric' => ':attribute :value க்கு மேல் அல்லது சமமாக இருக்க வேண்டும்.',
        'string' => ':attribute :value எழுத்துக்களுக்கு மேல் அல்லது சமமாக இருக்க வேண்டும்.',
    ],
    'hex_color' => ':attribute மைதானம் சரியான ஹெக்ஸாடெசிமல் நிறமாக இருக்க வேண்டும்.',
    'image' => ':attribute மைதானம் ஒரு படமாக இருக்க வேண்டும்.',
    'in' => 'தேர்ந்தெடுக்கப்பட்ட :attribute தவறானது.',
    'in_array' => ':attribute மைதானம் :other மைதானத்தில் இருக்க வேண்டும்.',
    'integer' => ':attribute மைதானம் முழு எண்ணாக இருக்க வேண்டும்.',
    'ip' => ':attribute மைதானம் சரியான IP முகவரியாக இருக்க வேண்டும்.',
    'ipv4' => ':attribute மைதானம் சரியான IPv4 முகவரியாக இருக்க வேண்டும்.',
    'ipv6' => ':attribute மைதானம் சரியான IPv6 முகவரியாக இருக்க வேண்டும்.',
    'json' => ':attribute மைதானம் சரியான JSON வரியாக இருக்க வேண்டும்.',
    'lowercase' => ':attribute மைதானம் சிறிய எழுத்துகளாக இருக்க வேண்டும்.',
    'lt' => [
        'array' => ':attribute மைதானத்தில் :value பொருட்களுக்கு குறைவாக இருக்க வேண்டும்.',
        'file' => ':attribute :value கிலோபைட்டுகளுக்கு குறைவாக இருக்க வேண்டும்.',
        'numeric' => ':attribute :value க்கு குறைவாக இருக்க வேண்டும்.',
        'string' => ':attribute :value எழுத்துக்களுக்கு குறைவாக இருக்க வேண்டும்.',
    ],
    'lte' => [
        'array' => ':attribute மைதானத்தில் :value பொருட்கள் அல்லது அதற்கு குறைவாக இருக்க வேண்டும்.',
        'file' => ':attribute :value கிலோபைட்டுகளுக்கு குறைவாக அல்லது சமமாக இருக்க வேண்டும்.',
        'numeric' => ':attribute :value க்கு குறைவாக அல்லது சமமாக இருக்க வேண்டும்.',
        'string' => ':attribute :value எழுத்துக்களுக்கு குறைவாக அல்லது சமமாக இருக்க வேண்டும்.',
    ],
    'mac_address' => ':attribute மைதானம் சரியான MAC முகவரியாக இருக்க வேண்டும்.',
    'max' => [
        'array' => ':attribute மைதானத்தில் :max பொருட்களுக்கு மேல் இருக்க கூடாது.',
        'file' => ':attribute :max கிலோபைட்டுகளுக்கு மேல் இருக்க கூடாது.',
        'numeric' => ':attribute :max க்கு மேல் இருக்க கூடாது.',
        'string' => ':attribute :max எழுத்துக்களுக்கு மேல் இருக்க கூடாது.',
    ],
    'max_digits' => ':attribute மைதானத்தில் :max இலக்கங்களுக்கு மேல் இருக்க கூடாது.',
    'mimes' => ':attribute :values வகையைச் சேர்ந்த கோப்பாக இருக்க வேண்டும்.',
    'mimetypes' => ':attribute :values வகையைச் சேர்ந்த கோப்பாக இருக்க வேண்டும்.',
    'min' => [
        'array' => ':attribute மைதானத்தில் குறைந்தது :min பொருட்கள் இருக்க வேண்டும்.',
        'file' => ':attribute குறைந்தது :min கிலோபைட்டுகள் இருக்க வேண்டும்.',
        'numeric' => ':attribute குறைந்தது :min இருக்க வேண்டும்.',
        'string' => ':attribute குறைந்தது :min எழுத்துக்கள் இருக்க வேண்டும்.',
    ],
    'min_digits' => ':attribute மைதானத்தில் குறைந்தது :min இலக்கங்கள் இருக்க வேண்டும்.',
    'missing' => ':attribute மைதானம் காணப்படவில்லை.',
    'missing_if' => ':other :value ஆக இருக்கும்போது :attribute மைதானம் காணப்பட வேண்டும்.',
    'missing_unless' => ':other :value ஆக இல்லாவிட்டால், :attribute மைதானம் காணப்பட வேண்டும்.',
    'missing_with' => ':values உள்ளது என்றால், :attribute மைதானம் காணப்பட வேண்டும்.',
    'missing_with_all' => ':values உள்ளது என்றால், :attribute மைதானம் காணப்பட வேண்டும்.',
    'multiple_of' => ':attribute :value இன் பன்மடங்கு இருக்க வேண்டும்.',
    'not_in' => 'தேர்ந்தெடுக்கப்பட்ட :attribute தவறானது.',
    'not_regex' => ':attribute வடிவம் தவறானது.',
    'numeric' => ':attribute மைதானம் ஒரு எண்ணாக இருக்க வேண்டும்.',
    'password' => [
        'letters' => ':attribute குறைந்தது ஒரு எழுத்து கொண்டிருக்க வேண்டும்.',
        'mixed' => ':attribute குறைந்தது ஒரு பெரிய எழுத்து மற்றும் ஒரு சிறிய எழுத்து கொண்டிருக்க வேண்டும்.',
        'numbers' => ':attribute குறைந்தது ஒரு எண் கொண்டிருக்க வேண்டும்.',
        'symbols' => ':attribute குறைந்தது ஒரு சின்னம் கொண்டிருக்க வேண்டும்.',
        'uncompromised' => 'நீங்கள் கொடுத்த :attribute ஒரு தரவுச்செலுத்தலில் தெரியவந்துள்ளது. வேறு ஒரு :attribute ஐத் தேர்ந்தெடுக்கவும்.',
    ],
    'present' => ':attribute மைதானம் உள்ளது வேண்டும்.',
    'present_if' => ':other :value ஆக இருக்கும்போது :attribute மைதானம் உள்ளது வேண்டும்.',
    'present_unless' => ':other :value ஆக இல்லாவிட்டால், :attribute மைதானம் உள்ளது வேண்டும்.',
    'present_with' => ':values உள்ளது என்றால், :attribute மைதானம் உள்ளது வேண்டும்.',
    'present_with_all' => ':values உள்ளது என்றால், :attribute மைதானம் உள்ளது வேண்டும்.',
    'prohibited' => ':attribute மைதானம் தடைசெய்யப்பட்டுள்ளது.',
    'prohibited_if' => ':other :value ஆக இருக்கும்போது :attribute மைதானம் தடைசெய்யப்பட்டுள்ளது.',
    'prohibited_unless' => ':other :values இல் இல்லாவிட்டால் :attribute மைதானம் தடைசெய்யப்பட்டுள்ளது.',
    'prohibits' => ':attribute மைதானம் :other இருப்பதை தடைசெய்கிறது.',
    'regex' => ':attribute வடிவம் தவறானது.',
    'required' => ':attribute மைதானம் தேவை.',
    'required_array_keys' => ':attribute மைதானத்தில் :values உள்ள எண்கள் இருக்க வேண்டும்.',
    'required_if' => ':other :value ஆக இருக்கும்போது :attribute மைதானம் தேவை.',
    'required_if_accepted' => ':other ஏற்றுக்கொள்ளப்பட்டால் :attribute மைதானம் தேவை.',
    'required_unless' => ':other :values இல் இல்லாவிட்டால், :attribute மைதானம் தேவை.',
    'required_with' => ':values உள்ளது என்றால், :attribute மைதானம் தேவை.',
    'required_with_all' => ':values உள்ளது என்றால், :attribute மைதானம் தேவை.',
    'required_without' => ':values இல்லை என்றால், :attribute மைதானம் தேவை.',
    'required_without_all' => ':values இல் எதுவும் இல்லை என்றால், :attribute மைதானம் தேவை.',
    'same' => ':attribute மற்றும் :other ஒன்று பொருந்த வேண்டும்.',
    'size' => [
        'array' => ':attribute மைதானம் :size பொருட்களை கொண்டிருக்க வேண்டும்.',
        'file' => ':attribute :size கிலோபைட்டுகள் இருக்க வேண்டும்.',
        'numeric' => ':attribute :size இருக்க வேண்டும்.',
        'string' => ':attribute :size எழுத்துக்கள் இருக்க வேண்டும்.',
    ],
    'starts_with' => ':attribute :values இல் ஒன்றால் தொடங்க வேண்டும்.',
    'string' => ':attribute மைதானம் சரியாக ஒரு சரம் இருக்க வேண்டும்.',
    'timezone' => ':attribute மைதானம் சரியான நேர வலயமாக இருக்க வேண்டும்.',
    'unique' => ':attribute ஏற்கனவே எடுத்துக்கொள்ளப்பட்டுள்ளது.',
    'uploaded' => ':attribute ஏற்றுவது தோல்வியடைந்தது.',
    'uppercase' => ':attribute மைதானம் பெரிய எழுத்தாக இருக்க வேண்டும்.',
    'url' => ':attribute மைதானம் சரியான URL ஆக இருக்க வேண்டும்.',
    'ulid' => ':attribute சரியான ULID ஆக இருக்க வேண்டும்.',
    'uuid' => ':attribute சரியான UUID ஆக இருக்க வேண்டும்.',

    /*
    |--------------------------------------------------------------------------
    | தனிப்பயன் சரிபார்ப்பு மொழி வரிகள்
    |--------------------------------------------------------------------------
    |
    | இங்கே நீங்கள் குறிப்பிட்ட தனிப்பயன் சரிபார்ப்பு செய்திகளை வரையறுக்கலாம்.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | தனிப்பயன் சரிபார்ப்பு பண்புகள்
    |--------------------------------------------------------------------------
    |
    | கீழே உள்ள வரிகள் எங்கள் பண்புகளை மாற்றச் செய்யப்படுகிறது.
    |
    */

    'attributes' => [],

];
